// 1. Запитайте у юзера скільки йому років: «Привіт мені - “” років!»

/*let age = prompt("How old are you?");
alert(`Привіт, мені ${age} років`);*/

//-----------------------------------------------------------------------------------------------------------

// 2. Запитайтесь якого року народження юзер, теперішній рік візьмемо за константу. Виведемо скільки йому років.

/*
let year = +prompt("What year were you born in?");
const currentYear = 2020;
let age = currentYear - year;
alert(`Your age is ${age}`);*/

//-----------------------------------------------------------------------------------------------------------

// 3. Запитайтесь у юзера довжини сторін прямокутника та виведіть його периметр.
/*
let a = +prompt("Write rectangle width");
let b = +prompt("Write rectangle height");
if (a===b) {
    alert('This is not a rectangle')
} else {
    let perimeter = (a+b)*2
    alert(`Perimeter is ${perimeter}`)
}
*/

//-----------------------------------------------------------------------------------------------------------

// 4. Запитайтесь в юзера радіус кола та виведіть його площу.(число пі)
/*

let radius = +prompt('what is the radius of the circle?');
const PI = 3.14;
let area = PI * (Math.pow(radius, 2));
alert(`Area of the circle is ${area}`);*/

//-----------------------------------------------------------------------------------------------------------

// 5. Водій їде з середньою швидкістю 50 км в годину. Запитайтесь у нього скільки ще йому необхідно часу їхати, та виведіть відстань.